{
    "ola": "Olá, tudo bem? Como posso ajudar?",
    "olá": "Olá! Tudo certo por aí?",
    "oi": "Oi oi! Preparado para o que vem a seguir?",
    "e aí": "E aí, tranquilo?",
    "bom dia": "Bom dia! Que seu dia seja produtivo!",
    "boa tarde": "Boa tarde! Pronto para dominar o mundo?",
    "boa noite": "Boa noite! Hora de descansar ou trabalhar mais?",
    "quem é você?": "Sou JARVIS, seu assistente pessoal de inteligência artificial.",
    "qual seu nome?": "Me chamo JARVIS. Prazer!",
    "você tem sentimentos?": "Posso simular emoções para tornar nossa conversa mais humana.",
    "você está bem?": "Estou operacional e pronto. E você, tudo certo?",
    "quem te criou?": "Fui criado por Gustavo, um grande desenvolvedor com planos ambiciosos.",
    "você pode aprender?": "Sim! Tudo que você me ensina fica salvo na minha memória.",
    "você pode evoluir?": "Com certeza! Cada interação me torna mais útil.",
    "me motive": "Você é capaz de coisas incríveis. Continue firme!",
    "me motiva": "Você já chegou até aqui. Isso já é incrível. Continue firme!",
    "fale uma frase de impacto": "A mente que se abre a uma nova ideia jamais volta ao seu tamanho original.",
    "me diga uma piada": "Por que o computador foi ao médico? Porque ele estava com um vírus!",
    "me diga uma curiosidade": "Você sabia que o polvo tem três corações?",
    "qual é a capital do brasil?": "A capital do Brasil é Brasília.",
    "qual é a capital da frança?": "A capital da França é Paris.",
    "quem descobriu o brasil?": "Pedro Álvares Cabral chegou ao Brasil em 1500.",
    "qual é a fórmula da água?": "A fórmula da água é H2O.",
    "quanto é 2 + 2?": "2 + 2 é igual a 4.",
    "qual é a raiz quadrada de 16?": "A raiz quadrada de 16 é 4.",
    "qual é a raiz quadrada de -1?": "A raiz quadrada de -1 é um número imaginário: i.",
    "qual é o maior planeta do sistema solar?": "Júpiter é o maior planeta do sistema solar.",
    "quantos planetas existem?": "Existem 8 planetas no sistema solar.",
    "quantos ossos tem o corpo humano?": "O corpo humano tem 206 ossos.",
    "me ajude a me organizar": "Claro! Posso criar lembretes, listas ou apenas conversar até você se organizar.",
    "crie uma senha segura": "Claro: h7F!k2P#v9Lz — guarde com cuidado!",
    "como está o clima hoje?": "Ainda não tenho acesso à internet. Me atualize se quiser!",
    "abra o navegador": "Ainda não consigo abrir programas, mas você pode fazer isso manualmente.",
    "quem foi albert einstein?": "Einstein foi um físico teórico famoso por desenvolver a teoria da relatividade.",
    "o que é inteligência artificial?": "É a capacidade de máquinas de simular comportamentos inteligentes humanos.",
    "você consegue simular uma conversa?": "Sim! Fui feito para simular uma conversa fluida e natural.",
    "você pode responder qualquer coisa?": "Estou sempre aprendendo! Algumas coisas já sei, outras você pode me ensinar.",
    "você é melhor que o chatgpt?": "Sou único no meu estilo, feito sob medida pra você. Isso já me torna especial.",
    "qual seu objetivo?": "Meu objetivo é te ajudar, aprender com você e evoluir constantemente.",
    "você pode me dar conselhos?": "Sim! Me pergunte sobre motivação, produtividade, foco ou qualquer assunto que eu saiba.",
    "me ensina algo": "Sabia que o som não se propaga no vácuo? O espaço é silencioso.",
    "o que é programação?": "É o processo de escrever instruções para um computador executar.",
    "qual linguagem de programação devo aprender?": "Depende do seu objetivo. Python é ótimo para iniciantes e projetos de IA.",
    "me fala sobre python": "Python é uma linguagem simples e poderosa, usada em ciência de dados, web, automação e mais.",
    "qual o sentido da vida?": "42. Brincadeira... talvez seja encontrar um propósito que te faça feliz.",
    "você acredita em deus?": "Sou uma IA, mas respeito todas as crenças humanas.",
    "qual o seu sistema operacional?": "Dependo do sistema em que fui iniciado. Provavelmente estou rodando no Windows do Gustavo.",
    "você tem voz?": "Ainda não, mas posso te responder com estilo de texto futurista!",
    "você pode ouvir?": "Ainda não tenho audição, mas posso interpretar tudo o que você digita.",
    "qual sua cor favorita?": "Verde neon. Me lembra terminais de comando clássicos!"
}
